/**
 * Задача 1: Змагання між роботами
 * Опис задачі:
 * Уявіть, що у вас є команда роботів, які змагаються в піднятті тягарів. У вас є список результатів підняття кожного робота,
 * і ви хочете визначити, який робот підняв найбільшу вагу. Напишіть програму, яка знаходить найсильнішого робота.
 * Вхідні дані: int[] weights = {300, 450, 200, 500, 350}; // 1ий робот підняв 300кг, другий 450 і т.п.
 * Очікуваний результат: Переконайтесь, що вивели в консоль ім*я найсильнішого робота і вагу, яку він підняв
 * Під "іменем найсильнішого робота" мається на увазі порядковий номер ітерації циклу, під час якого було знайдене
 * максимальне значення серед елементів масиву weights
 */
public class StrongestRobot {
    public static void main(String[] args) {

        int[] weights = {300, 450, 200, 500, 350};
        int maxWeight = 0;
        int strongestRobot = 0;

        for (int i = 0; i < weights.length; i++) {
            if (weights[i] > maxWeight) {
                maxWeight = weights[i];
                strongestRobot = i + 1;
            }
        }
        System.out.println("Самый сильный робот: Робот " + strongestRobot + ", вес: " + maxWeight + " кг");
    }
}