/**
 * Задача 2: Відстеження споживання води
 * Опис задачі:
 * Уявіть, що ви хочете відстежувати, скільки води ви п'єте кожного дня протягом тижня. Ви записуєте кількість випитих
 * склянок води кожного дня в масив. Напишіть програму, яка використовує цикл while для підрахунку загальної кількості
 * випитих склянок води. Якщо ви випили менше двох склянок води за день, програма повинна пропустити цей день і продовжити
 * підрахунок для наступних днів
 * Вхідні дані: int[] waterIntake = {3, 1, 4, 2, 0, 5, 2};
 * Очікуваний результат: переконайтесь, що після виконання програми ви вивели в консоль сумарну кількість випитих склянок
 * води за тиждень (при підрахунку суми не включали ті дні, коли ви пили менше двох склянок)
 */
public class WaterIntakeTracker {
    public static void main(String[] args) {
        int[] waterIntake = {3, 1, 4, 2, 0, 5, 2};
        int totalWater = 0;
        int i = 0;

        while (i < waterIntake.length) {
            if (waterIntake[i] >= 2) {
                totalWater = totalWater + waterIntake[i];
            }
               i++;
        }

        System.out.println("Общее количество выпитых стаканов воды за неделю: " + totalWater);

    }
}